#include <iostream>

void human(int numb) {
    std::string ones[20] = { "","один","два","три","четыре","пять","шесть","семь","восемь","девять","десять","одиннадцать",
        "двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать" };
    std::string tens[10] = { "","","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто" };
    std::string hundreds[10] = { "","сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот" };
    if (numb != 0) {
        std::cout << hundreds[numb / 100] << " ";
    }
    if (numb % 100 > 19) {
        std::cout << tens[(numb / 10) % 10] << " ";
        std::cout << ones[numb % 10] << " ";
    }
    else {
        std::cout << ones[numb % 100] << " ";
    }
}

int main() {
    int N, X;
    std::cin >> N;
    setlocale(LC_ALL, "Russian");
    if (N == 1000000000) {
        std::cout << "один миллиард";
        N = 0;
    }
    X = (N / 1000000);
    N = N % 1000000;
    if (X != 0) {
        human(X);
        if ((X % 100 > 19) || (X % 100 < 10)) {
            if (X % 10 == 1) {
                std::cout << "миллион" << " ";
            }
            else if ((X % 10 == 2) || (X % 10 == 3) || (X % 10 == 4)) {
                std::cout << "миллиона" << " ";
            }
            else {
                std::cout << "миллионов" << " ";
            }
        }
        else {
            std::cout << "миллионов" << " ";
        }
    }
    X = N / 1000;
    N = N % 1000;
    if (X != 0) {
        if ((X % 100 > 19) || (X % 100 < 10)) {
            if (X % 10 == 1) {
                --X;
                human(X);
                std::cout << "одна тысяча" << " ";
            }
            else if (X % 10 == 2) {
                X -= 2;
                human(X);
                std::cout << "две тысячи" << " ";
            }
            else if ((X % 10 == 3) || (X % 10 == 4)) {
                human(X);
                std::cout << "тысячи" << " ";
            }
            else {
                human(X);
                std::cout << "тысяч" << " ";
            }
        }
        else {
            human(X);
            std::cout << "тысяч" << " ";
        }
    }
    human(N);
    return 0;
}
